Show / Hide Table of Contents
Class ConcreteSLSCheckResultStressLimitationEc2
SLS Check Stress Limitation Ec2
Inheritance
System.Object
ConcreteCheckResultBase
ConcreteSLSCheckResultStressLimitation
ConcreteSLSCheckResultStressLimitationEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ConcreteSLSCheckResultStressLimitationEc2 : ConcreteSLSCheckResultStressLimitation
Properties
Improve this Doc   View Source
LimitStress
type of SLS limit stress check
Declaration
public double LimitStress { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Stress
type of SLS limit stress check
Declaration
public double Stress { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
TypeCheck
type of SLS limit stress check
Declaration
public TypeSLSLimitStressCheck TypeCheck { get; set; }
Property Value
 Type |  Description
 TypeSLSLimitStressCheck
 Improve this Doc
 View Source